10/data/attachments/11df1c4c4f0afc2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d439e020-d2e4-47bd-9aac-ecc0b42b9abd</nif:username>
            <nif:friendToBeAdded>Monica_reflect_Friend_54870_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>